InformationRegisters/СтатусФизическихЛицКакНалогоплательщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусФизическихЛицКакНалогоплательщиков</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыФизическихЛицНалогоплательщиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмеетПравоНаПенсионноеОбеспечение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодлежитСоциальномуСтрахованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодлежитСоциальномуМедицинскомуСтрахованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыФизическихЛицНалогоплательщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыФизическихЛицНалогоплательщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Резидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерезидент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СтатусФизическихЛицКакНалогоплательщиков/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Тогда
		СтатусРезидент = ПредопределенноеЗначение("Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент");
		Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
			ЗаписьНабора.Статус = СтатусРезидент;
			ЗаписьНабора.Период = '19000101';
			ЗаписьНабора.ИмеетПравоНаПенсионноеОбеспечение = Истина;
			ЗаписьНабора.ПодлежитСоциальномуСтрахованию = Истина;
			ЗаписьНабора.ПодлежитСоциальномуМедицинскомуСтрахованию = Истина;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
